在含有27个结点的二叉搜索树上，查找关键字为35的结点，则被依次比较的关键字有可能是（a）。 (2分)

46,36,18,28,35
46,28,18,36,35
28,36,18,46,35
18,36,28,46,35
作者: 严冰
单位: 浙江大学城市学院
2-2
若二叉搜索树是有N个结点的完全二叉树，则不正确的说法是：c(1分)

所有结点的平均查找效率是O(logN)
最小值一定在叶结点上
最大值一定在叶结点上
中位值结点在根结点或根的左子树上
作者: 何钦铭
单位: 浙江大学
2-3
将{ 32, 2, 15, 65, 28, 10 }依次插入初始为空的二叉搜索树。则该树d
的前序遍历结果是：(3分)

2, 10, 15, 28, 32, 65
32, 2, 10, 15, 28, 65
10, 28, 15, 2, 65, 32
32, 2, 15, 10, 28, 65
作者: 陈越
单位: 浙江大学
2-4
如果AVL树的深度为5（空树的深度定义为0），则此树最少有多少个结点？a (3分)

12
20
33
64
作者: 陈越
单位: 浙江大学
2-5
已知8个数据元素为（34，76，45，18，26，54，92，65），按照依次插入结点
的方法生成一棵二叉搜索树后，最后两层上的结点总数为：b (2分)

1
2
3
4
作者: DS课程组
单位: 浙江大学
2-6
AVL树是一种平衡的二叉搜索树，树中任一结点具有下列哪一特性：b (1分)

左、右子树的高度均相同
左、右子树高度差的绝对值不超过1
左子树的高度均大于右子树的高度
左子树的高度均小于右子树的高度
作者: DS课程组
单位: 浙江大学
2-7
下列二叉搜索树中，满足平衡二叉树定义的是：c (1分)





作者: DS课程组
单位: 浙江大学
2-8
若一棵二叉树的前序遍历序列是{ 4, 2, 1, 3, 6, 5, 7 }，中序遍历
序列是{ 1, 2, 3, 4, 5, 6, 7 }，则下列哪句是错的？b(3分)

这是一棵完全二叉树
4是3的父结点
所有的奇数都在叶子结点上
这是一棵二叉搜索树
