将10, 12, 1, 14, 6, 5, 8, 15, 3, 9, 7逐个按顺序插
入到初始为空的最小堆中，然后连续执行两次删除最小元素
操作（DeleteMin），再插入4，16，此后堆顶的元素是什么？a (2分)

4
5
7
9
作者: 何钦铭
单位: 浙江大学
2-2
已知字符集{ a, b, c, d, e, f, g, h }。若各字符的哈夫曼编
码依次是 0100, 10, 0000, 0101, 001, 011, 11, 0001，则编码序
列 0100011001001011110101 的译码结果是：d(2分)

acgabfh
adbagbb
afbeagd
afeefgd
作者: 考研试卷
单位: 浙江大学
2-3
用线性时间复杂度的算法将给定序列{ 28, 12, 5, 8, 19, 20, 15, 22 }调整
为最大堆（大根堆），然后插入30。则结果序列为：d(3分)

{ 5, 8, 28, 12, 19, 20, 15, 22, 30 }
{ 30, 28, 20, 22, 12, 5, 15, 8, 19 }
{ 30, 28, 22, 20, 19, 15, 12, 8, 5 }
{ 30, 28, 20, 22, 19, 5, 15, 8, 12 }
作者: 冯雁
单位: 浙江大学
2-4
用线性时间复杂度的算法将给定序列{15, 26, 32, 8, 7, 20, 12, 13, 5, 19}调整为
最小堆（小根堆），然后插入6。下列句子中错误的是：c(3分)

5是根
从根到26的路径是{5, 6, 8, 26}
32是12的左孩子
7是19和15的父结点
作者: 陈越
单位: 浙江大学
2-5
对最小堆（小顶堆）{1,3,2,6,7,5,4,15,14,12,9,10,11,13,8} 进行三次删除最
小元的操作后，结果序列为：b(2分)

4,5,6,7,8,9,10,11,12,13,14,15
4,6,5,13,7,10,8,15,14,12,9,11
4,6,5,12,7,10,8,15,14,9,13,11
4,5,6,12,7,10,8,15,14,13,9,11
作者: DS课程组
单位: 浙江大学
2-6
下列的序列中，哪一组是堆？c (2分)

37,99,45,33,66,10,22,13
99,45,66,13,37,10,22,33
99,66,45,33,37,10,22,13
99,66,22,33,37,13,45,10
作者: DS课程组
单位: 浙江大学
2-7
对N（N≥2）个权值均不相同的字符构造哈夫曼树。下列关于该哈夫曼
树的叙述中，错误的是： d(2分)

树中一定没有度为1的结点
树中两个权值最小的结点一定是兄弟结点
树中任一非叶结点的权值一定不小于下一层任一结点的权值
该树一定是一棵完全二叉树
作者: DS课程组
单位: 浙江大学
2-8
设一段文本中包含字符{a, b, c, d, e}，其出现频率相应为{3, 2, 5, 1, 1}。
则经过哈夫曼编码后，文本所占字节数为：c (2分)

40
36
25
12
作者: DS课程组
单位: 浙江大学
2-9
由分别带权为9、2、5、7的四个叶子结点构成一棵哈夫曼树，该树的带权路径长度为：c (2分)

23
37
44
46
作者: DS课程组
单位: 浙江大学
2-10
将数字 {10, 12, 1, 14, 6, 5, 8, 15, 3, 9, 7, 4, 11, 13, 2} 逐一插入
一个初始为空的最小堆（小顶堆），得到的堆序列为：d (2分)

1,3,2,12,6,4,8,15,14,9,7,5,11,13,10
1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
1,2,3,6,7,5,4,15,14,12,9,10,11,13,8
1,3,2,6,7,5,4,15,14,12,9,10,11,13,8
作者: DS课程组
单位: 浙江大学
保存
单选题
123456
