对一棵满二叉树，m个树叶，n个结点，深度为h，则（d）。 (2分)

n=h+m
h+m=2n
m=h-1
n=2
?h
?? -1

2-2
深度为4的满二叉树的结点数为（b）。 (2分)

7
15
16
31
作者: 严冰
单位: 浙江大学城市学院
2-3
有关树和二叉树的叙述错误的是（c）。 (2分)

树中的最大度数没有限制，而二叉树结点的最大度数为2；
树的结点无左右之分，而二叉树的结点有左右之分；
树的每个结点的孩子数为0到多个, 而二叉树每个结点均有两个孩子；
树和二叉树均为树形结构
作者: 严冰
单位: 浙江大学城市学院
2-4
按照二叉树定义，具有3个结点的二叉树共有（c）种形态。 (2分)

3
4
5
6

2-5
一个具有1025个结点的二叉树的高h为（c）。 (2分)

10
11
11～1025
10～1024
作者: 严冰
单位: 浙江大学城市学院
2-6
在有n个结点的二叉树的二叉链表表示中，空指针数（b）。 (2分)

不定
n+1
n
n-1
作者: 严冰
单位: 浙江大学城市学院
2-7
一棵二叉树中，双分支结点数为15，单分支结点数为30，则叶子结点数为（b）个。 (2分)

15
16
17
47
作者: 严冰
单位: 浙江大学城市学院
2-8
要使一棵非空二叉树的先序序列与中序序列相同，其所有非叶结点须满足的条件是：b(2分)

只有左子树
只有右子树
结点的度均为1
结点的度均为2
作者: 考研试卷
单位: 浙江大学
2-9
已知一棵二叉树的树形如下图所示，其后序序列为{ e, a, c, b, d, g, f }。树中与结点a同层
的结点是：b(3分)



c
d
f
g
作者: 考研试卷
单位: 浙江大学
2-10
若一棵二叉树的前序遍历序列是{ 4, 2, 1, 3, 6, 5, 7 }，中序遍历序列
是{ 1, 2, 3, 4, 5, 6, 7 }，则下列哪句是错的？d(3分)

这是一棵完全二叉树
所有的奇数都在叶子结点上
这是一棵二叉搜索树
2是5的父结点
作者: 何钦铭
单位: 浙江大学
2-11
二叉树的中序遍历也可以循环地完成。给定循环中堆栈的操作序列如下
（其中push为入栈，pop为出栈）：

push(1), push(2), push(3), pop(), push(4), pop(), pop(), push(5), pop(), pop(), push(6), pop()
以下哪句是对的？(3分)b

6是根结点
3和5是兄弟结点
2是4的父结点
以上全不对
作者: 何钦铭
单位: 浙江大学
2-12
如果二叉树的前序遍历结果是12345，后序遍历结果是32541，那么
该二叉树的中序遍历结果是什么？ (2分)d

23145
23154
24135
无法确定
作者: DS课程组
单位: 浙江大学
2-13
如果二叉树的前序遍历结果是12345，后序遍历结果是24531，那么
该二叉树的中序遍历结果是什么？ (3分)c

23145
32154
21435
无法确定
作者: DS课程组
单位: 浙江大学
2-14
在下述结论中，正确的是：a (2分)

①只有一个结点的二叉树的度为0;

②二叉树的度为2；

③二叉树的左右子树可任意交换；

④深度为K的完全二叉树的结点个数小于或等于深度相同的满二叉树。

①④
②④
①②③
②③④
作者: DS课程组
单位: 浙江大学
2-15
二叉树中第5层（根的层号为1）上的结点个数最多为：c(2分)

8
15
16
32
作者: DS课程组
单位: 浙江大学
2-16
先序遍历图示二叉树的结果为b (2分)



A，B，C，D，H，E，I，F，G
A，B，D，H，I，E，C，F，G
H，D，I，B，E，A，F，C，G
H，I，D，B，E，F，G，A，C
作者: DS课程组
单位: 浙江大学
2-17
某二叉树的前序和后序遍历序列正好相反，则该二叉树一定是b (2分)

空或只有一个结点
高度等于其结点数
任一结点无左孩子
任一结点无右孩子
作者: DS课程组
单位: 浙江大学
2-18
已知一棵二叉树的先序遍历结果是ABC，则以下哪个序列是不可能的中序遍历结果：d (2分)

ABC
BAC
CBA
CAB
